package day0117;

/**
 * 대입연산자<br>
 * 순수 대입 : =
 * 산술 대입: +=, -=, *=, /=, %=<br>
 * 쉬프트 대입 : <<=, >>=, >>>=<br>
 * 비트논리 대입 : &=. |=, ^=
 */
public class Operator7 {

	public static void main(String[] args) {
		int i = 3; // 대입연산자. 변수 =초기화값;
		i=4; 
		//산술 대입 : 대상체의 값과 연상하여 대상체의 값을 연산결과로 변경한다.
		i+=2;//6
		i-=3;//3
		i*=3;//9
		i/=2;//4.5 -> 4. 정수/정수=정수, 정수/실수=실수, 실수/실수=실수 
//		double d=9/2.0;
//		double d=9/0.2;
//		double d= (double)9/2;
		double d=9/(double)2;
		
		i %= 3; //i=i%3;
		//쉬프트 대입;
		i <<= 4; // i = i <<4;  0000 0001  << 4 = 0001 0000=16
		i >>= 1; // i = i >> 1; 0001 0000 >> 1 = 0000 1000=8
		i>>>=2; // i=i>>>2; // 0000 1000 >>>2=0000 0010 (00)
		
		//비트논리 대입
		i &= 10;// i =i & 10 // 0000 0010 & 0000 1010 = 0000 0010
		i |= 19;// i = i|19 // 0000 0010 | 0001 0011 = 0001 0011
		i ^= 16; // i=i^16; // 0001 0011 ^ 0001 0000 = 00000 0011
		
		
		
		
		System.out.println(i);
		System.out.println(d);
		
		
		
	}//main

}//class
